Examinator/src/Catalogs/ЭлементыЭлектронныхРесурсов/ЭлементыЭлектронныхРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыЭлектронныхРесурсов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ЭлектронныеРесурсы</owners>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлементовЭлектронныхРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроигрыватьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВнешнийЭлемент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеЭлемента</name>
    <attributes>
      <name>КодДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеДанных</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрисоединенныйФайл</name>
      <type>
        <types>CatalogRef.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеОбмена</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеДляИндексирования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Гиперссылки</name>
    <attributes>
      <name>ЭлементСодержания</name>
      <type>
        <types>CatalogRef.СодержаниеЭлектронныхКурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Страница</name>
      <type>
        <types>CatalogRef.СтраницыЭлементовЭлектронныхКурсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыЭлементовЭлектронныхРесурсов/ТипыЭлементовЭлектронныхРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлементовЭлектронныхРесурсов</name>
  <enumValues>
    <name>File</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
  <enumValues>
    <name>Text</name>
  </enumValues>
  <enumValues>
    <name>Presentation</name>
  </enumValues>
  <enumValues>
    <name>Table</name>
  </enumValues>
  <enumValues>
    <name>YouTube</name>
  </enumValues>
  <enumValues>
    <name>HTML</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ЭлементыЭлектронныхРесурсов/Forms/ФормаВыбораСпособаРазмещенияВидео/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ФорматВидеоВИнтернете) Тогда
		ФорматВидеоВИнтернете = "video/mp4"
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВставитьВидеоYouTube(Команда)
	
	Если НЕ ЗначениеЗаполнено(АдресВидеоYouTube) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес видео YouTube не указан'"),,"ВставитьВидеоYouTube","ВставитьВидеоYouTube");
		Возврат;
	КонецЕсли;
	
	ИдентификаторВидео = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ИдентификаторВидеоYouTubeИзURI(АдресВидеоYouTube);
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторВидео) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес не содержит идентификатор видео.
		|Укажите адрес страницы видео с сайта youtube.com.'"),,"ВставитьВидеоYouTube","ВставитьВидеоYouTube");
		Возврат;
	КонецЕсли;	
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВидеоYouTube");
	РезультатВыбора.Вставить("ИдентификаторВидео", ИдентификаторВидео);
	
	Закрыть(РезультатВыбора);		
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВидеоИзИнтернета(Команда)
	
	Если НЕ ЗначениеЗаполнено(АдресВидеоВИнтернете) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес видео не указан'"),,"АдресВидеоВИнтернете","АдресВидеоВИнтернете");
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВидеоИзИнтернета");
	РезультатВыбора.Вставить("ГиперссылкаНаВидео", АдресВидеоВИнтернете);
	РезультатВыбора.Вставить("ФорматВидео", ФорматВидеоВИнтернете);
	
	Закрыть(РезультатВыбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВидеоСДиска(Команда)
	
	#Если ВебКлиент Тогда
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайлаВидеоВХранилище", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
		
	#Иначе
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайлаВидео", ЭтотОбъект);
	
	МассивТиповВыбора = Новый Массив;
	МассивТиповВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовЭлектронныхРесурсов.Video"));
	
	ДиалогВыбораВидео = РазработкаЭлектронныхКурсовСлужебныйКлиент.ДиалогВыбораФайлаПоТипу(
		МассивТиповВыбора,
		НСтр("ru = 'Выберите файл с видео'"),
		НСтр("ru = 'Видео'")
	);
	
	ДиалогВыбораВидео.Показать(ОписаниеОповещения);
	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПослеВыбораФайлаВидео(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВыбранныеФайлы");
	РезультатВыбора.Вставить("ВыбранныеФайлы", ВыбранныеФайлы);
	
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиФайлаВидеоВХранилище(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ПомещенныеФайлы");
	РезультатВыбора.Вставить("Результат", Результат);
	РезультатВыбора.Вставить("Адрес", Адрес);
	РезультатВыбора.Вставить("ВыбранноеИмяФайла", ВыбранноеИмяФайла);
	
	Закрыть(РезультатВыбора);	
	
КонецПроцедуры

#КонецОбласти
